RestoreCalloutParent Method
 Restores callout parent ID to the original view ID if that view is still available.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void RestoreCalloutParent()
Visual Basic
Public Sub RestoreCalloutParent
Visual C++
public:
void RestoreCalloutParent()
Remarks
 Nothing is done if the callout already has parent or if the original callout parent is deleted or is not parallel to the callout view.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInvalidOperationException |  This view is not a callout.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →